#if 0
;
; Input signature:
;
; Name                 Index   Mask Register SysValue  Format   Used
; -------------------- ----- ------ -------- -------- ------- ------
; no parameters
;
; Output signature:
;
; Name                 Index   Mask Register SysValue  Format   Used
; -------------------- ----- ------ -------- -------- ------- ------
; no parameters
; shader debug name: a527045d68214a91ed0f53b0fe1aeab8.pdb
; shader hash: a527045d68214a91ed0f53b0fe1aeab8
;
; Pipeline Runtime Information: 
;
;
;
; Buffer Definitions:
;
; cbuffer GenerateMipsCB
; {
;
;   struct GenerateMipsCB
;   {
;
;       uint SrcMipLevel;                             ; Offset:    0
;       uint NumMipLevels;                            ; Offset:    4
;       uint SrcDimension;                            ; Offset:    8
;       bool IsSRGB;                                  ; Offset:   12
;       float2 TexelSize;                             ; Offset:   16
;   
;   } GenerateMipsCB;                                 ; Offset:    0 Size:    24
;
; }
;
;
; Resource Bindings:
;
; Name                                 Type  Format         Dim      ID      HLSL Bind  Count
; ------------------------------ ---------- ------- ----------- ------- -------------- ------
; GenerateMipsCB                    cbuffer      NA          NA     CB0            cb0     1
; LinearClampSampler                sampler      NA          NA      S0             s0     1

!0 = distinct !DICompileUnit(language: DW_LANG_C_plus_plus, file: !1, producer: "clang version 3.7 (tags/RELEASE_370/final)", isOptimized: false, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !3, subprograms: !23, globals: !63)
!1 = !DIFile(filename: "GenerateMips_CS.hlsl", directory: "")
!2 = !{}
!3 = !{!4, !16}
!4 = !DIDerivedType(tag: DW_TAG_typedef, name: "float4", file: !1, line: 96, baseType: !5)
!5 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 4>", file: !1, line: 96, size: 128, align: 32, elements: !6, templateParams: !12)
!6 = !{!7, !9, !10, !11}
!7 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !5, file: !1, line: 96, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!8 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!9 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !5, file: !1, line: 96, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!10 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !5, file: !1, line: 96, baseType: !8, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!11 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !5, file: !1, line: 96, baseType: !8, size: 32, align: 32, offset: 96, flags: DIFlagPublic)
!12 = !{!13, !14}
!13 = !DITemplateTypeParameter(name: "element", type: !8)
!14 = !DITemplateValueParameter(name: "element_count", type: !15, value: i32 4)
!15 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!16 = !DIDerivedType(tag: DW_TAG_typedef, name: "float2", file: !1, line: 21, baseType: !17)
!17 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 2>", file: !1, line: 21, size: 64, align: 32, elements: !18, templateParams: !21)
!18 = !{!19, !20}
!19 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !17, file: !1, line: 21, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!20 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !17, file: !1, line: 21, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!21 = !{!13, !22}
!22 = !DITemplateValueParameter(name: "element_count", type: !15, value: i32 2)
!23 = !{!24, !44, !47, !57, !60}
!24 = !DISubprogram(name: "main", scope: !1, file: !1, line: 93, type: !25, isLocal: false, isDefinition: true, scopeLine: 94, flags: DIFlagPrototyped, isOptimized: false, function: void ()* @main)
!25 = !DISubroutineType(types: !26)
!26 = !{null, !27}
!27 = !DICompositeType(tag: DW_TAG_structure_type, name: "ComputeShaderInput", file: !1, line: 7, size: 320, align: 32, elements: !28)
!28 = !{!29, !40, !41, !42}
!29 = !DIDerivedType(tag: DW_TAG_member, name: "GroupID", scope: !27, file: !1, line: 9, baseType: !30, size: 96, align: 32)
!30 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint3", file: !1, line: 52, baseType: !31)
!31 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<unsigned int, 3>", file: !1, line: 52, size: 96, align: 32, elements: !32, templateParams: !37)
!32 = !{!33, !35, !36}
!33 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !31, file: !1, line: 52, baseType: !34, size: 32, align: 32, flags: DIFlagPublic)
!34 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !31, file: !1, line: 52, baseType: !34, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !31, file: !1, line: 52, baseType: !34, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!37 = !{!38, !39}
!38 = !DITemplateTypeParameter(name: "element", type: !34)
!39 = !DITemplateValueParameter(name: "element_count", type: !15, value: i32 3)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "GroupThreadID", scope: !27, file: !1, line: 10, baseType: !30, size: 96, align: 32, offset: 96)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "DispatchThreadID", scope: !27, file: !1, line: 11, baseType: !30, size: 96, align: 32, offset: 192)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "GroupIndex", scope: !27, file: !1, line: 12, baseType: !43, size: 32, align: 32, offset: 288)
!43 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint", file: !1, line: 17, baseType: !34)
!44 = !DISubprogram(name: "PackColor", linkageName: "\01?PackColor@@YA?AV?$vector@M$03@@V1@@Z", scope: !1, file: !1, line: 78, type: !45, isLocal: false, isDefinition: true, scopeLine: 79, flags: DIFlagPrototyped, isOptimized: false)
!45 = !DISubroutineType(types: !46)
!46 = !{!4, !4}
!47 = !DISubprogram(name: "ConvertToSRGB", linkageName: "\01?ConvertToSRGB@@YA?AV?$vector@M$02@@V1@@Z", scope: !1, file: !1, line: 72, type: !48, isLocal: false, isDefinition: true, scopeLine: 73, flags: DIFlagPrototyped, isOptimized: false)
!48 = !DISubroutineType(types: !49)
!49 = !{!50, !50}
!50 = !DIDerivedType(tag: DW_TAG_typedef, name: "float3", file: !1, line: 88, baseType: !51)
!51 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 3>", file: !1, line: 88, size: 96, align: 32, elements: !52, templateParams: !56)
!52 = !{!53, !54, !55}
!53 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !51, file: !1, line: 88, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !51, file: !1, line: 88, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !51, file: !1, line: 88, baseType: !8, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!56 = !{!13, !39}
!57 = !DISubprogram(name: "StoreColor", linkageName: "\01?StoreColor@@YAXIV?$vector@M$03@@@Z", scope: !1, file: !1, line: 54, type: !58, isLocal: false, isDefinition: true, scopeLine: 55, flags: DIFlagPrototyped, isOptimized: false)
!58 = !DISubroutineType(types: !59)
!59 = !{null, !43, !4}
!60 = !DISubprogram(name: "LoadColor", linkageName: "\01?LoadColor@@YA?AV?$vector@M$03@@I@Z", scope: !1, file: !1, line: 62, type: !61, isLocal: false, isDefinition: true, scopeLine: 63, flags: DIFlagPrototyped, isOptimized: false)
!61 = !DISubroutineType(types: !62)
!62 = !{!4, !43}
!63 = !{!64, !66, !67, !68, !71, !73, !77, !78, !79, !80, !84, !86, !87, !88, !89}
!64 = !DIGlobalVariable(name: "SrcMipLevel", linkageName: "\01?SrcMipLevel@GenerateMipsCB@@3IB", scope: !0, file: !1, line: 17, type: !65, isLocal: false, isDefinition: true)
!65 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !43)
!66 = !DIGlobalVariable(name: "NumMipLevels", linkageName: "\01?NumMipLevels@GenerateMipsCB@@3IB", scope: !0, file: !1, line: 18, type: !65, isLocal: false, isDefinition: true)
!67 = !DIGlobalVariable(name: "SrcDimension", linkageName: "\01?SrcDimension@GenerateMipsCB@@3IB", scope: !0, file: !1, line: 19, type: !65, isLocal: false, isDefinition: true)
!68 = !DIGlobalVariable(name: "IsSRGB", linkageName: "\01?IsSRGB@GenerateMipsCB@@3_NB", scope: !0, file: !1, line: 20, type: !69, isLocal: false, isDefinition: true)
!69 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !70)
!70 = !DIBasicType(name: "bool", size: 32, align: 32, encoding: DW_ATE_boolean)
!71 = !DIGlobalVariable(name: "TexelSize", linkageName: "\01?TexelSize@GenerateMipsCB@@3V?$vector@M$01@@B", scope: !0, file: !1, line: 21, type: !72, isLocal: false, isDefinition: true)
!72 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !16)
!73 = !DIGlobalVariable(name: "gs_R", linkageName: "\01?gs_R@@3PAMA", scope: !0, file: !1, line: 49, type: !74, isLocal: false, isDefinition: true, variable: [64 x float] addrspace(3)* @"\01?gs_R@@3PAMA")
!74 = !DICompositeType(tag: DW_TAG_array_type, baseType: !8, size: 2048, align: 32, elements: !75)
!75 = !{!76}
!76 = !DISubrange(count: 64)
!77 = !DIGlobalVariable(name: "gs_G", linkageName: "\01?gs_G@@3PAMA", scope: !0, file: !1, line: 50, type: !74, isLocal: false, isDefinition: true, variable: [64 x float] addrspace(3)* @"\01?gs_G@@3PAMA")
!78 = !DIGlobalVariable(name: "gs_B", linkageName: "\01?gs_B@@3PAMA", scope: !0, file: !1, line: 51, type: !74, isLocal: false, isDefinition: true, variable: [64 x float] addrspace(3)* @"\01?gs_B@@3PAMA")
!79 = !DIGlobalVariable(name: "gs_A", linkageName: "\01?gs_A@@3PAMA", scope: !0, file: !1, line: 52, type: !74, isLocal: false, isDefinition: true, variable: [64 x float] addrspace(3)* @"\01?gs_A@@3PAMA")
!80 = !DIGlobalVariable(name: "SrcMip", linkageName: "\01?SrcMip@@3V?$Texture2D@V?$vector@M$03@@@@A", scope: !0, file: !1, line: 25, type: !81, isLocal: false, isDefinition: true)
!81 = !DICompositeType(tag: DW_TAG_class_type, name: "Texture2D<vector<float, 4> >", file: !1, line: 25, size: 160, align: 32, elements: !2, templateParams: !82)
!82 = !{!83}
!83 = !DITemplateTypeParameter(name: "element", type: !5)
!84 = !DIGlobalVariable(name: "OutMip1", linkageName: "\01?OutMip1@@3V?$RWTexture2D@V?$vector@M$03@@@@A", scope: !0, file: !1, line: 28, type: !85, isLocal: false, isDefinition: true)
!85 = !DICompositeType(tag: DW_TAG_class_type, name: "RWTexture2D<vector<float, 4> >", file: !1, line: 28, size: 128, align: 32, elements: !2, templateParams: !82)
!86 = !DIGlobalVariable(name: "OutMip2", linkageName: "\01?OutMip2@@3V?$RWTexture2D@V?$vector@M$03@@@@A", scope: !0, file: !1, line: 29, type: !85, isLocal: false, isDefinition: true)
