#if 0
;
; Input signature:
;
; Name                 Index   Mask Register SysValue  Format   Used
; -------------------- ----- ------ -------- -------- ------- ------
; POSITION                 0   xy          0     NONE   float   xy  
; COLOR                    0   xyzw        1     NONE   float   xyzw
; TEXCOORD                 0   xy          2     NONE   float   xy  
;
;
; Output signature:
;
; Name                 Index   Mask Register SysValue  Format   Used
; -------------------- ----- ------ -------- -------- ------- ------
; SV_Position              0   xyzw        0      POS   float   xyzw
; COLOR                    0   xyzw        1     NONE   float   xyzw
; TEXCOORD                 0   xy          2     NONE   float   xy  
;
; shader debug name: 70e82fdcfc03f58a7911393f83a8e223.pdb
; shader hash: 70e82fdcfc03f58a7911393f83a8e223
;
; Pipeline Runtime Information: 
;
; Vertex Shader
; OutputPositionPresent=1
;
;
; Input signature:
;
; Name                 Index             InterpMode DynIdx
; -------------------- ----- ---------------------- ------
; POSITION                 0                              
; COLOR                    0                              
; TEXCOORD                 0                              
;
; Output signature:
;
; Name                 Index             InterpMode DynIdx
; -------------------- ----- ---------------------- ------
; SV_Position              0          noperspective       

!0 = distinct !DICompileUnit(language: DW_LANG_C_plus_plus, file: !1, producer: "clang version 3.7 (tags/RELEASE_370/final)", isOptimized: false, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !3, subprograms: !16, globals: !37)
!1 = !DIFile(filename: "ImGUI_VS.hlsl", directory: "")
!2 = !{}
!3 = !{!4}
!4 = !DIDerivedType(tag: DW_TAG_typedef, name: "float4", file: !1, line: 3, baseType: !5)
!5 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 4>", file: !1, line: 3, size: 128, align: 32, elements: !6, templateParams: !12)
!6 = !{!7, !9, !10, !11}
!7 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !5, file: !1, line: 3, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!8 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!9 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !5, file: !1, line: 3, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!10 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !5, file: !1, line: 3, baseType: !8, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!11 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !5, file: !1, line: 3, baseType: !8, size: 32, align: 32, offset: 96, flags: DIFlagPublic)
!12 = !{!13, !14}
!13 = !DITemplateTypeParameter(name: "element", type: !8)
!14 = !DITemplateValueParameter(name: "element_count", type: !15, value: i32 4)
!15 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!16 = !{!17}
!17 = !DISubprogram(name: "main", scope: !1, file: !1, line: 20, type: !18, isLocal: false, isDefinition: true, scopeLine: 21, flags: DIFlagPrototyped, isOptimized: false, function: void ()* @main)
!18 = !DISubroutineType(types: !19)
!19 = !{!20, !32}
!20 = !DICompositeType(tag: DW_TAG_structure_type, name: "PS_INPUT", file: !1, line: 13, size: 320, align: 32, elements: !21)
!21 = !{!22, !23, !24}
!22 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !20, file: !1, line: 15, baseType: !4, size: 128, align: 32)
!23 = !DIDerivedType(tag: DW_TAG_member, name: "col", scope: !20, file: !1, line: 16, baseType: !4, size: 128, align: 32, offset: 128)
!24 = !DIDerivedType(tag: DW_TAG_member, name: "uv", scope: !20, file: !1, line: 17, baseType: !25, size: 64, align: 32, offset: 256)
!25 = !DIDerivedType(tag: DW_TAG_typedef, name: "float2", file: !1, line: 3, baseType: !26)
!26 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 2>", file: !1, line: 3, size: 64, align: 32, elements: !27, templateParams: !30)
!27 = !{!28, !29}
!28 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !26, file: !1, line: 3, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!29 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !26, file: !1, line: 3, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!30 = !{!13, !31}
!31 = !DITemplateValueParameter(name: "element_count", type: !15, value: i32 2)
!32 = !DICompositeType(tag: DW_TAG_structure_type, name: "VS_INPUT", file: !1, line: 6, size: 256, align: 32, elements: !33)
!33 = !{!34, !35, !36}
!34 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !32, file: !1, line: 8, baseType: !25, size: 64, align: 32)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "col", scope: !32, file: !1, line: 9, baseType: !4, size: 128, align: 32, offset: 64)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "uv", scope: !32, file: !1, line: 10, baseType: !25, size: 64, align: 32, offset: 192)
!37 = !{!38}
!38 = !DIGlobalVariable(name: "ProjectionMatrix", linkageName: "\01?ProjectionMatrix@vertexBuffer@@3V?$matrix@M$03$03@@B", scope: !0, file: !1, line: 3, type: !39, isLocal: false, isDefinition: true)
!39 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !40)
!40 = !DIDerivedType(tag: DW_TAG_typedef, name: "float4x4", file: !1, line: 3, baseType: !41)
!41 = !DICompositeType(tag: DW_TAG_class_type, name: "matrix<float, 4, 4>", file: !1, line: 3, size: 512, align: 32, elements: !42, templateParams: !59)
!42 = !{!43, !44, !45, !46, !47, !48, !49, !50, !51, !52, !53, !54, !55, !56, !57, !58}
!43 = !DIDerivedType(tag: DW_TAG_member, name: "_11", scope: !41, file: !1, line: 3, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "_12", scope: !41, file: !1, line: 3, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "_13", scope: !41, file: !1, line: 3, baseType: !8, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "_14", scope: !41, file: !1, line: 3, baseType: !8, size: 32, align: 32, offset: 96, flags: DIFlagPublic)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "_21", scope: !41, file: !1, line: 3, baseType: !8, size: 32, align: 32, offset: 128, flags: DIFlagPublic)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "_22", scope: !41, file: !1, line: 3, baseType: !8, size: 32, align: 32, offset: 160, flags: DIFlagPublic)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "_23", scope: !41, file: !1, line: 3, baseType: !8, size: 32, align: 32, offset: 192, flags: DIFlagPublic)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "_24", scope: !41, file: !1, line: 3, baseType: !8, size: 32, align: 32, offset: 224, flags: DIFlagPublic)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "_31", scope: !41, file: !1, line: 3, baseType: !8, size: 32, align: 32, offset: 256, flags: DIFlagPublic)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "_32", scope: !41, file: !1, line: 3, baseType: !8, size: 32, align: 32, offset: 288, flags: DIFlagPublic)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "_33", scope: !41, file: !1, line: 3, baseType: !8, size: 32, align: 32, offset: 320, flags: DIFlagPublic)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "_34", scope: !41, file: !1, line: 3, baseType: !8, size: 32, align: 32, offset: 352, flags: DIFlagPublic)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "_41", scope: !41, file: !1, line: 3, baseType: !8, size: 32, align: 32, offset: 384, flags: DIFlagPublic)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "_42", scope: !41, file: !1, line: 3, baseType: !8, size: 32, align: 32, offset: 416, flags: DIFlagPublic)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "_43", scope: !41, file: !1, line: 3, baseType: !8, size: 32, align: 32, offset: 448, flags: DIFlagPublic)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "_44", scope: !41, file: !1, line: 3, baseType: !8, size: 32, align: 32, offset: 480, flags: DIFlagPublic)
!59 = !{!13, !60, !61}
!60 = !DITemplateValueParameter(name: "row_count", type: !15, value: i32 4)
!61 = !DITemplateValueParameter(name: "col_count", type: !15, value: i32 4)
!62 = !{i32 2, !"Dwarf Version", i32 4}
!63 = !{i32 2, !"Debug Info Version", i32 3}
!64 = !{!"clang version 3.7 (tags/RELEASE_370/final)"}
!65 = !{!"ImGUI_VS.hlsl", !"cbuffer vertexBuffer : register(b0)\0D\0A{\0D\0A    float4x4 ProjectionMatrix;\0D\0A};\0D\0A\0D\0Astruct VS_INPUT\0D\0A{\0D\0A    float2 pos : POSITION;\0D\0A    float4 col : COLOR0;\0D\0A    float2 uv : TEXCOORD0;\0D\0A};\0D\0A\0D\0Astruct PS_INPUT\0D\0A{\0D\0A    float4 pos : SV_Position;\0D\0A    float4 col : COLOR0;\0D\0A    float2 uv : TEXCOORD0;\0D\0A};\0D\0A\0D\0APS_INPUT main(VS_INPUT input)\0D\0A{\0D\0A    PS_INPUT output;\0D\0A    output.pos = mul(ProjectionMatrix, float4(input.pos.xy, 0.f, 1.0f));\0D\0A    output.col = input.col;\0D\0A    output.uv = input.uv;\0D\0A\09return output;\0D\0A}"}
!66 = !{!"ImGUI_VS.hlsl"}
!67 = !{!"-E", !"main", !"-T", !"vs_6_0", !"/Fo", !"C:\5CUsers\5Cjo_serravalle\5Csource\5Crepos\5CLearningAttempt2\5Cx64\5CDebug\5CImGUI_VS.cso", !"/Od", !"/Zi", !"-Qembed_debug"}
!68 = !{i32 1, i32 0}
!69 = !{i32 1, i32 6}
!70 = !{!"vs", i32 6, i32 0}
!71 = !{null, null, !72, null}
!72 = !{!73}
!73 = !{i32 0, %hostlayout.vertexBuffer* undef, !"vertexBuffer", i32 0, i32 0, i32 1, i32 64, null}
!74 = !{i32 0, %hostlayout.vertexBuffer undef, !75}
!75 = !{i32 64, !76}
!76 = !{i32 6, !"ProjectionMatrix", i32 2, !77, i32 3, i32 0, i32 7, i32 9}
!77 = !{i32 4, i32 4, i32 2}
!78 = !{i32 1, void ()* @main, !79}
!79 = !{!80}
!80 = !{i32 0, !2, !2}
!81 = !{[12 x i32] [i32 10, i32 10, i32 15, i32 15, i32 0, i32 0, i32 16, i32 32, i32 64, i32 128, i32 256, i32 512]}
!82 = !{void ()* @main, !"main", !83, !71, !95}
!83 = !{!84, !91, null}
!84 = !{!85, !88, !90}
!85 = !{i32 0, !"POSITION", i8 9, i8 0, !86, i8 0, i32 1, i8 2, i32 0, i8 0, !87}
!86 = !{i32 0}
!87 = !{i32 3, i32 3}
!88 = !{i32 1, !"COLOR", i8 9, i8 0, !86, i8 0, i32 1, i8 4, i32 1, i8 0, !89}
!89 = !{i32 3, i32 15}
!90 = !{i32 2, !"TEXCOORD", i8 9, i8 0, !86, i8 0, i32 1, i8 2, i32 2, i8 0, !87}
!91 = !{!92, !93, !94}
!92 = !{i32 0, !"SV_Position", i8 9, i8 3, !86, i8 4, i32 1, i8 4, i32 0, i8 0, !89}
!93 = !{i32 1, !"COLOR", i8 9, i8 0, !86, i8 2, i32 1, i8 4, i32 1, i8 0, !89}
!94 = !{i32 2, !"TEXCOORD", i8 9, i8 0, !86, i8 2, i32 1, i8 2, i32 2, i8 0, !87}
!95 = !{i32 0, i64 1}
!96 = !DILocation(line: 20, column: 24, scope: !17)
!97 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "input", arg: 1, scope: !17, file: !1, line: 20, type: !32)
!98 = !DIExpression(DW_OP_bit_piece, 192, 32)
!99 = !DIExpression(DW_OP_bit_piece, 224, 32)
!100 = !DIExpression(DW_OP_bit_piece, 64, 32)
!101 = !DIExpression(DW_OP_bit_piece, 96, 32)
!102 = !DIExpression(DW_OP_bit_piece, 128, 32)
!103 = !DIExpression(DW_OP_bit_piece, 160, 32)
!104 = !DIExpression(DW_OP_bit_piece, 0, 32)
!105 = !DIExpression(DW_OP_bit_piece, 32, 32)
!106 = !DILocation(line: 23, column: 22, scope: !17)
!107 = !DILocation(line: 23, column: 18, scope: !17)
!108 = !DILocation(line: 23, column: 16, scope: !17)
!109 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "output", arg: 0, scope: !17, file: !1, line: 22, type: !20)
!110 = !DILocation(line: 24, column: 16, scope: !17)
!111 = !DILocation(line: 25, column: 15, scope: !17)
!112 = !DIExpression(DW_OP_bit_piece, 256, 32)
!113 = !DIExpression(DW_OP_bit_piece, 288, 32)
!114 = !DILocation(line: 26, column: 2, scope: !17)

#endif

const unsigned char g_ImGUI_VS[] = {
  0x44, 0x58, 0x42, 0x43, 0xe1, 0x49, 0x8f, 0x0d, 0xe5, 0xa4, 0xf9, 0xfa,
  0x88, 0x72, 0x75, 0xf7, 0xef, 0xa9, 0x1c, 0x48, 0x01, 0x00, 0x00, 0x00,
  0xa3, 0x26, 0x00, 0x00, 0x09, 0x00, 0x00, 0x00, 0x44, 0x00, 0x00, 0x00,
  0x54, 0x00, 0x00, 0x00, 0xdc, 0x00, 0x00, 0x00, 0x67, 0x01, 0x00, 0x00,
